In [4]:
import numpy as np
import pandas as pd

In [5]:
pd.Series([10,83,3,4,5])

0    10
1    83
2     3
3     4
4     5
dtype: int64

In [6]:
ser = pd.Series([10,83,3,4,5])

In [7]:
ser

0    10
1    83
2     3
3     4
4     5
dtype: int64

***Basic Attributes***

In [8]:
type(ser)

pandas.core.series.Series

In [9]:
ser.dtype

dtype('int64')

In [10]:
ser.size

5

In [11]:
ser.ndim

1

In [12]:
ser.values  # lazy object

array([10, 83,  3,  4,  5], dtype=int64)

In [13]:
for i in ser.values:
    print(i)

10
83
3
4
5

In [14]:
[i for i in ser.values]

[10, 83, 3, 4, 5]

In [15]:
ser.head(3)  # icine yazdiginiz kadar satir gösterir

0    10
1    83
2     3
dtype: int64

In [16]:
ser.tail(3)  # sondan 3 satiri gösterir

2    3
3    4
4    5
dtype: int64

In [17]:
str = "clarusway"
pd.Series([i for i in str])  # burada bi liste olusturduk

0    c
1    l
2    a
3    r
4    u
5    s
6    w
7    a
8    y
dtype: object

**crating Pandas series by using a list, numpy array or dictionary**

In [18]:
labels =["a","b","c"]
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {"a":10, "b":20, "c":30}

In [19]:
pd.Series(data = my_list)

0    10
1    20
2    30
dtype: int64

In [20]:
pd.Series(data = my_list, index = labels)  # keyargument

a    10
b    20
c    30
dtype: int64

In [21]:
pd.Series(my_list, labels)  # argument

a    10
b    20
c    30
dtype: int64

In [22]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [23]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [24]:
pd.Series(d)  # dictionaray koyarsak keyler index olur valueler datanin kendisi olur

a    10
b    20
c    30
dtype: int64

In [25]:
mix_data = [1, "cat", True]

In [26]:
pd.Series(mix_data)

0       1
1     cat
2    True
dtype: object

In [27]:
str = "clarusway"
ser = pd.Series([i for i in str])

In [28]:
ser

0    c
1    l
2    a
3    r
4    u
5    s
6    w
7    a
8    y
dtype: object

In [29]:
ser.sort_values()

2    a
7    a
0    c
1    l
3    r
5    s
4    u
6    w
8    y
dtype: object

In [30]:
ser.sort_index()

0    c
1    l
2    a
3    r
4    u
5    s
6    w
7    a
8    y
dtype: object

In [31]:
ser.isin(["cow", "dog"])  # serinin icinde var mi yok mu onu gösteriyor var sa true veriyor

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

**Indexing Pandas Series**

In [32]:
ser1 = pd.Series([1,2,3,4], index = ["USA", "Germany", "USSR", "Japan"])

In [33]:
ser2 = pd.Series([1,2,5,4], index = ["USA", "Germany", "Italy", "Japan"])

In [34]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [35]:
ser1["USA"]  # indexi cagiriyorum value u aliyorum

1

In [36]:
ser2["Italy"]

5

In [37]:
labels

['a', 'b', 'c']

In [38]:
ser3 = pd.Series(data = labels)

In [39]:
ser3

0    a
1    b
2    c
dtype: object

In [40]:
ser3[0]

'a'

In [41]:
ser1 + ser2  # indexler ortak hareket ediyor

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [42]:
a = np.array([1,2,33,444,75])

In [43]:
a

array([  1,   2,  33, 444,  75])

In [44]:
panser = pd.Series(a)
panser

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [45]:
panser[0]  # pandas serisinden bir eleman döndurdu

1

In [46]:
panser[0:3]  # pandas serisini slicing yapiyoruz

0     1
1     2
2    33
dtype: int32

In [47]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [48]:
ser1["USA":"Japan"]  # indexin kendisini yazarsak hepsini getiriyor

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [49]:
ser1[2:3]  # sagda yazdigimizin bir eksigini alir

USSR    3
dtype: int64

In [50]:
ser1[2:4]

USSR     3
Japan    4
dtype: int64

In [51]:
panser = pd.Series([121,200,150,99], index = ["ali", "veli", "gül", "nur"])

In [52]:
panser

ali     121
veli    200
gül     150
nur      99
dtype: int64

In [53]:
panser["ali"]

121

In [54]:
panser[0]

121

In [55]:
panser[["veli", "nur"]]  # aradan cekip aldik, liste icinden aldik

veli    200
nur      99
dtype: int64

In [56]:
panser[0:3]

ali     121
veli    200
gül     150
dtype: int64

In [57]:
panser["ali" : "nur"]

ali     121
veli    200
gül     150
nur      99
dtype: int64

**Several Selecting Attributes**

In [58]:
panser.index

Index(['ali', 'veli', 'gül', 'nur'], dtype='object')

In [59]:
panser.values

array([121, 200, 150,  99], dtype=int64)

In [60]:
panser.values.sort()

In [61]:
panser.values

array([ 99, 121, 150, 200], dtype=int64)

In [62]:
panser.items

<bound method Series.items of ali      99
veli    121
gül     150
nur     200
dtype: int64>

In [63]:
panser.items()

In [64]:
list(panser.items())

[('ali', 99), ('veli', 121), ('gül', 150), ('nur', 200)]

In [65]:
panser = pd.Series([121,200,150,99], index = ["ali", "veli", "gül", "nur"])

In [66]:
list(panser.items())

[('ali', 121), ('veli', 200), ('gül', 150), ('nur', 99)]

In [67]:
[(index, value) for index, value in panser.items()]

[('ali', 121), ('veli', 200), ('gül', 150), ('nur', 99)]

In [68]:
for index, value in panser.items():
    print(index, "-", value)

ali - 121
veli - 200
gül - 150
nur - 99

In [69]:
"mehmet" in panser

False

In [70]:
"ali" in panser

True

In [71]:
"gülnur" in panser

False

In [72]:
"gul" in panser

False

In [73]:
99 in panser

False

In [74]:
99 in panser.values

True

In [75]:
500 in panser.values

False

In [76]:
panser["veli"]

200

In [77]:
panser["veli"] = 571  # bir indexi cagirdik ve deger atadik, broadcasting

In [78]:
panser > 130  # tüm valueler bool olarak dönüyor

ali     False
veli     True
gül      True
nur     False
dtype: bool

In [79]:
panser[panser>130]  # conditioni köseli parantez ile yazarsak o conditiona uyan yeri bize sergiler.

veli    571
gül     150
dtype: int64

# DATA FRAMES

In [80]:
datam = [1,2,39,79,90]

In [81]:
datam

[1, 2, 39, 79, 90]

In [82]:
pd.DataFrame(datam, columns = ["column_name"])  # column_name baslik olarak geliyor

   column_name
0            1
1            2
2           39
3           79
4           90

In [83]:
m = np.arange(1,10).reshape((3,3))

In [84]:
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [85]:
pd.DataFrame(m, columns = ["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [86]:
pd.DataFrame(data = m, columns = ["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [87]:
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])

In [88]:
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [89]:
df.head(1)

   var1  var2  var3
0     1     2     3

In [90]:
df.head(2)

   var1  var2  var3
0     1     2     3
1     4     5     6

In [91]:
df.tail(1)

   var1  var2  var3
2     7     8     9

In [92]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [93]:
for i in df.columns:
    print(i)

var1
var2
var3

In [94]:
df.columns = ["new1", "new2", "new3"]

In [95]:
df

   new1  new2  new3
0     1     2     3
1     4     5     6
2     7     8     9

In [96]:
type(df)

pandas.core.frame.DataFrame

In [97]:
df.shape

(3, 3)

In [98]:
df.ndim  # dimension, 2 boyutlu

2

In [99]:
df.size

9

In [100]:
df.values  # data ya ne girdiyse onu verir, numpy array verir

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [101]:
type(df.values)

numpy.ndarray

**Creating a Data Frame using a dict**

In [102]:
s1 = np.random.randint(10, size =5)
s2 = np.random.randint(10, size =5)
s3 = np.random.randint(10, size =5)

In [103]:
s1

array([8, 8, 9, 3, 6])

In [104]:
s2

array([1, 4, 7, 1, 7])

In [105]:
s3

array([2, 8, 7, 1, 0])

In [106]:
myDict = {"var1" : s1, "var2" : s2, "var3" : s3}  # keys= column name, data = values

In [107]:
df1 = pd.DataFrame(myDict)

In [108]:
df1

   var1  var2  var3
0     8     1     2
1     8     4     8
2     9     7     7
3     3     1     1
4     6     7     0

**Read CSV (comma seperated) file**

In [109]:
pwd

'C:\\Users\\aliyi\\DATA_SCIENCE\\02_Data_ANALYSIS_w_PYTHON'

In [110]:
pd.read_csv("ornekcsv.csv", delimiter = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [111]:
df3 = pd.read_csv("ornekcsv.csv", delimiter = ";")  # githubdaki proje bununla yapilabilir, githubdan projeyi indir, tamamladiktan sonra kendi githubina yukle

In [112]:
df3.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [113]:
df1

   var1  var2  var3
0     8     1     2
1     8     4     8
2     9     7     7
3     3     1     1
4     6     7     0

In [114]:
df1[1:3]  # satir,sütun indexi

   var1  var2  var3
1     8     4     8
2     9     7     7

In [115]:
df1.index  # lazy object

RangeIndex(start=0, stop=5, step=1)

In [116]:
[i for i in df1.index]  # cok sik kullanilabilecek bir metod, daha sonra index numaralari baska bir yerde kullanilabilir

[0, 1, 2, 3, 4]

In [117]:
df1.index = ["a", "b", "c", "d", "e"]  # atama yaptik

In [118]:
df1

   var1  var2  var3
a     8     1     2
b     8     4     8
c     9     7     7
d     3     1     1
e     6     7     0

In [119]:
df1["b" : "d"]  # slicelama da string olursa sinirlar dahil ediyor, rakam kullanirsak stop degerini dahil etmiyor

   var1  var2  var3
b     8     4     8
c     9     7     7
d     3     1     1

In [120]:
# sütun isimleri arasinda var mi kontrol ediyorum

"var2" in df1

True

In [121]:
"joseph" in df1

False

**Indexing, selection and slicing methods and several attributes using different DatFrame**

In [122]:
from numpy.random import randn
np.random.seed(101)

In [123]:
df3 = pd.DataFrame(randn(5,4), index = "A B C D E".split(), columns = "W X Y Z".split())

In [124]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [125]:
df3 = pd.DataFrame(randn(5,4), "A B C D E".split(), "W X Y Z".split())

In [126]:
df3

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

**Selection and Indexing**

In [127]:
df3["W"]  # sütunu aldim, serieyi aldim daha dogrusu

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [128]:
type(df3["W"])  # Pandas Series

pandas.core.series.Series

In [129]:
df3["W"].values

array([ 0.30266545, -0.13484072,  0.80770591, -0.49710402, -0.11677332])

In [130]:
df3["W"].ndim

1

In [131]:
df3[["W"]]  # DataFrame döndü

          W
A  0.302665
B -0.134841
C  0.807706
D -0.497104
E -0.116773

In [132]:
type(df3[["W"]])

pandas.core.frame.DataFrame

In [133]:
istedigimsütunlar = ["W", "Z"]

df3[istedigimsütunlar]  # bu bir DataFrame

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [134]:
WZ_df = df3[istedigimsütunlar]

In [135]:
WZ_df

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [136]:
df3[["W","Z"]]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [137]:
# alttaki ikisi ayni sey
df3["W"]
df3.W  # bu kullanim builtinmethodlar ile karisacagindan cok tercih edilmiyor

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [138]:
df3["W"]

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [139]:
df3["A" : "C"]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646

In [140]:
df3["C" : "C"]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [141]:
df3

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [148]:
df3["new"] = df3["W"] + df3["Y"]  # yeni sütun olustu

In [149]:
df3

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [150]:
df3["new2"] = df3["W"] * df3["Y"]  # yeni sütun olustu

In [151]:
df3

          W         X         Y         Z       new      new2
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420 -0.516373
B -0.134841  0.390528  0.166905  0.184502  0.032064 -0.022506
C  0.807706  0.072960  0.638787  0.329646  1.446493  0.515952
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510  0.468971
E -0.116773  1.901755  0.238127  1.996652  0.121354 -0.027807

## Removing Column

In [152]:
df3.drop(["new", "new2"], axis = 1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [153]:
df3

          W         X         Y         Z       new      new2
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420 -0.516373
B -0.134841  0.390528  0.166905  0.184502  0.032064 -0.022506
C  0.807706  0.072960  0.638787  0.329646  1.446493  0.515952
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510  0.468971
E -0.116773  1.901755  0.238127  1.996652  0.121354 -0.027807

In [154]:
df3.drop(["new", "new2"], axis = 1, inplace = True)  # absolute delete with inplace

In [155]:
df3

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

## Removing Rows

In [156]:
df3.drop("E", axis = 0)  # E ist weg.

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

## Selecting Rows (.loc, .iloc)

In [159]:
# loc works with labels, not works with indexnumbers
m = np.random.randint(1,30, size = (10,3))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df4.head()

   var1  var2  var3
0     8    28     6
1    15     8     6
2     5    21    24
3     4    16     3
4     4    19    26

In [161]:
df4.loc[1]  # label 1 yani 2.satiri gösteriyor

var1    15
var2     8
var3     6
Name: 1, dtype: int32

In [164]:
df4.loc[[1,2]]  # label 1 ve 2 yani satirlar

   var1  var2  var3
1    15     8     6
2     5    21    24

In [168]:
df4.loc[1:6]  # label olarak kabul etti, 6 dahil

   var1  var2  var3
1    15     8     6
2     5    21    24
3     4    16     3
4     4    19    26
5    14    15     4
6    15    29     6

In [169]:
df4.iloc[1:6]  # index olarak kabul etti, 6 dahil degil

   var1  var2  var3
1    15     8     6
2     5    21    24
3     4    16     3
4     4    19    26
5    14    15     4

In [170]:
df4.index = "a b c d e f g h i j".split()  # indexleri degistirdik

In [171]:
df4

   var1  var2  var3
a     8    28     6
b    15     8     6
c     5    21    24
d     4    16     3
e     4    19    26
f    14    15     4
g    15    29     6
h    23    23    22
i    27    22    18
j    24    12     5

In [173]:
df4.iloc[1:4]

   var1  var2  var3
b    15     8     6
c     5    21    24
d     4    16     3

In [178]:
df4.loc["b":"d"]

   var1  var2  var3
b    15     8     6
c     5    21    24
d     4    16     3

In [181]:
df4.loc["b","var2"]

8

In [182]:
df4.iloc[1,1]

8

In [183]:
df4.loc["b":"e"]

   var1  var2  var3
b    15     8     6
c     5    21    24
d     4    16     3
e     4    19    26

In [190]:
df4.loc["b":"e", "var2"]

b     8
c    21
d    16
e    19
Name: var2, dtype: int32

In [192]:
df4.loc["b":"e"][["var2"]]

   var2
b     8
c    21
d    16
e    19

In [195]:
df4.loc["b":"e",["var2"]]

   var2
b     8
c    21
d    16
e    19

In [197]:
df4.iloc[1:5,[1]]

   var2
b     8
c    21
d    16
e    19

In [198]:
df4.iloc[1:5,1]

b     8
c    21
d    16
e    19
Name: var2, dtype: int32

In [200]:
df4.iloc[1:5][["var2"]]  # hem labelli hem de indexli yaptik

   var2
b     8
c    21
d    16
e    19

In [204]:
df3  # df olarak verdi

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [205]:
df3.loc["A"]  # seri olarak verdi

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [207]:
df3.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [208]:
df3.iloc[2]  # seri olarak aldik

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [209]:
df3.loc[["B"]]  # df olarak aldik

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502

In [211]:
df3.iloc[[2]]  # df olarak aldik

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [213]:
df3.iloc[:, [2]]  # df

          Y
A -1.706086
B  0.166905
C  0.638787
D -0.943406
E  0.238127

In [214]:
df3.iloc[:, 2]  # seri

A   -1.706086
B    0.166905
C    0.638787
D   -0.943406
E    0.238127
Name: Y, dtype: float64

In [217]:
df3[:][["Y"]]  # loc iloc suz

          Y
A -1.706086
B  0.166905
C  0.638787
D -0.943406
E  0.238127

In [218]:
df3[["Y"]]  # # loc iloc suz

          Y
A -1.706086
B  0.166905
C  0.638787
D -0.943406
E  0.238127

In [220]:
df3.Y  # direk seri verir ama cok da tercih edilmez

A   -1.706086
B    0.166905
C    0.638787
D   -0.943406
E    0.238127
Name: Y, dtype: float64

In [221]:
df3.loc["B", "Y"]

0.16690463609281317

In [222]:
df3

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [223]:
df3.loc[["B"],["Y"]]  # tek bir eleman DF olarak geldi

          Y
B  0.166905

In [224]:
df3.loc[["A","B"],["W","Y"]]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [225]:
df3.iloc[[0,1],[0,2]]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [227]:
df3 > 0  # boolean DF veriyor kosullarda

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [228]:
df3[df3>0]  # kosullu selection yapiyoruz

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [229]:
df3["W"] > 0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [230]:
df.iloc[[True, False, True]]

   new1  new2  new3
0     1     2     3
2     7     8     9

In [231]:
df3[df3["W"] > 0]  # tek bir sutuna bakarak tüm DF'dan selection yaptik

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [233]:
df3[[True, True, False, True, True]]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [235]:
df3[df3["W"] > 0][["Y"]]  # DF

          Y
A -1.706086
C  0.638787

In [236]:
df3[df3["W"] > 0]["Y"]  # seri

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [237]:
df3[df3["W"] > 0][["Y","X"]]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

## or and conditions

In [239]:
df3[(df3["W"] > 0) & (df3["Y"] < 1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [240]:
df3.loc[(df3.X > 0), ["X", "Z"]]  # kosulu olarak satiri sectim sonra yanina istedigim sutunlari ekledim

          X         Z
A  1.693723 -1.159119
B  0.390528  0.184502
C  0.072960  0.329646
E  1.901755  1.996652

In [241]:
df3

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [243]:
df3.loc[((df3.W > 2) | (df3.W < 2)), ["W","Y"]]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905
C  0.807706  0.638787
D -0.497104 -0.943406
E -0.116773  0.238127